polish README
